------------------------------------------------------------
       log:  C:\Documents and Settings\Jesse Rothstein\My Do
> cuments\projects\caelections\archive\makefinancepanel.log
  log type:  text
 opened on:   6 Mar 2010, 13:34:21

. 
. #delimit;
delimiter now ;
. clear;

. set mem 100m;

Current memory allocation

                    current                                 
> memory usage
    settable          value     description                 
> (1M = 1024k)
    --------------------------------------------------------
> ------------
    set maxvar         5000     max. variables allowed      
>      1.909M
    set memory          100M    max. data space             
>    100.000M
    set matsize         400     max. RHS vars in models     
>      1.254M
                                                            
> -----------
                                                            
>    103.163M

. /*
> if c(os)=="MacOSX" {;
>   local ccddir "/Volumes/JESSEDATA/ccd/";
> };
> else {;
>   local ccddir "d:/data/ccd";
>   *use z:\ccd\leafinance\cleaned\leafinance_panel_ca.dta;
> };
> */
> local ccddir ".";

. *use `ccddir'/leafinance/cleaned/leafinance_panel_ca.dta;
. use `ccddir'/leafinance_panel_ca.dta;

. keep if stfips==6;
(0 observations deleted)

.  replace cofips=cofips-6000 if cofips>6000 & cofips<7000;
(3265 real changes made)

. drop if leaid=="" | leaid=="N";
(222 observations deleted)

. *Drop districts that arent elementary/secondary/unified;
.  drop if level>3;
(912 observations deleted)

. *Check that county is constant within LEA over time;
.  sort leaid year;

.  by leaid: gen firstco=cofips[1];
(7 missing values generated)

.  count if cofips~=firstco;
   44

. *Assign each LEA to the modal county;
.  by leaid: egen modeco=mode(cofips);
Warning: at least one panel contains all missing values or
contains multiple modes.  Generating missing values for the
mode of these panels.  Use the missing, maxmode, minmode, or
nummode() options to control this behavior.
(8 missing values generated)

.  *One district has 4 of each -- break the tie for the earl
> ier county, as this dist is later absorbed;
.   replace modeco=19 if leaid=="0600023";
(8 real changes made)

.  gen ismode=(cofips==modeco);

.  by leaid: egen frmode=mean(ismode);

.  replace cofips=modeco;
(21 real changes made)

.  rename frmode cofips_recode;

.  drop modeco ismode;

. gen newleaid=leaid;

. replace newleaid="0636805" if leaid=="0600023";
(8 real changes made)

. replace newleaid="0600076" if leaid=="0600024";
(0 real changes made)

. replace newleaid="0600027" if leaid=="0600027";
(0 real changes made)

. replace newleaid="0600113" if leaid=="0600030";
(0 real changes made)

. replace newleaid="0600116" if leaid=="0600041";
(7 real changes made)

. replace newleaid="0636120" if leaid=="0600043";
(10 real changes made)

. replace newleaid="0691092" if leaid=="0600119";
(0 real changes made)

. replace newleaid="0600153" if leaid=="0601910";
(10 real changes made)

. replace newleaid="0600153" if leaid=="0601930";
(0 real changes made)

. replace newleaid="0600020" if leaid=="0602490";
(0 real changes made)

. replace newleaid="0600017" if leaid=="0602880";
(0 real changes made)

. replace newleaid="0636805" if leaid=="0603450";
(0 real changes made)

. replace newleaid="0614950" if leaid=="0604050";
(0 real changes made)

. replace newleaid="0691137" if leaid=="0604920";
(0 real changes made)

. replace newleaid="0614950" if leaid=="0606240";
(0 real changes made)

. replace newleaid="0600049" if leaid=="0607110";
(3 real changes made)

. replace newleaid="0691134" if leaid=="0607320";
(0 real changes made)

. replace newleaid="0614950" if leaid=="0607380";
(0 real changes made)

. replace newleaid="0600067" if leaid=="0607620";
(5 real changes made)

. replace newleaid="0600067" if leaid=="0607650";
(5 real changes made)

. *replace newleaid="0600023" if leaid=="0608280";
. replace newleaid="0600049" if leaid=="0609180";
(3 real changes made)

. replace newleaid="0629540" if leaid=="0609666";
(0 real changes made)

. replace newleaid="0600039" if leaid=="0610920";
(0 real changes made)

. replace newleaid="0600047" if leaid=="0610990";
(5 real changes made)

. replace newleaid="0600065" if leaid=="0611160";
(4 real changes made)

. replace newleaid="0600065" if leaid=="0611190";
(4 real changes made)

. replace newleaid="0600033" if leaid=="0611370";
(0 real changes made)

. replace newleaid="0600033" if leaid=="0611410";
(0 real changes made)

. replace newleaid="0600026" if leaid=="0612240";
(0 real changes made)

. replace newleaid="0600027" if leaid=="0612540";
(0 real changes made)

. replace newleaid="0600027" if leaid=="0612570";
(0 real changes made)

. replace newleaid="0602250" if leaid=="0612660";
(7 real changes made)

. replace newleaid="0600052" if leaid=="0613040";
(0 real changes made)

. replace newleaid="0600052" if leaid=="0613060";
(4 real changes made)

. replace newleaid="0600035" if leaid=="0613590";
(0 real changes made)

. replace newleaid="0600037" if leaid=="0613660";
(0 real changes made)

. replace newleaid="0600037" if leaid=="0613680";
(0 real changes made)

. replace newleaid="0609030" if leaid=="0614640";
(0 real changes made)

. replace newleaid="0600046" if leaid=="0615540";
(3 real changes made)

. replace newleaid="0600046" if leaid=="0615570";
(3 real changes made)

. replace newleaid="0600051" if leaid=="0616140";
(4 real changes made)

. replace newleaid="0600051" if leaid=="0616170";
(4 real changes made)

. replace newleaid="0600018" if leaid=="0616710";
(0 real changes made)

. replace newleaid="0600044" if leaid=="0616770";
(1 real change made)

. replace newleaid="0600044" if leaid=="0616800";
(1 real change made)

. replace newleaid="0691134" if leaid=="0616890";
(0 real changes made)

. replace newleaid="0600011" if leaid=="0617010";
(0 real changes made)

. replace newleaid="0600060" if leaid=="0617910";
(4 real changes made)

. replace newleaid="0600060" if leaid=="0617940";
(4 real changes made)

. replace newleaid="0600018" if leaid=="0618090";
(0 real changes made)

. replace newleaid="0600011" if leaid=="0622530";
(0 real changes made)

. replace newleaid="0600014" if leaid=="0622780";
(0 real changes made)

. replace newleaid="0600015" if leaid=="0623070";
(0 real changes made)

. replace newleaid="0600025" if leaid=="0623580";
(0 real changes made)

. replace newleaid="0600038" if leaid=="0624120";
(0 real changes made)

. replace newleaid="0600022" if leaid=="0624510";
(0 real changes made)

. replace newleaid="0600019" if leaid=="0626520";
(0 real changes made)

. replace newleaid="0600029" if leaid=="0626550";
(0 real changes made)

. replace newleaid="0600036" if leaid=="0626700";
(0 real changes made)

. replace newleaid="0600116" if leaid=="0627540";
(0 real changes made)

. replace newleaid="0600062" if leaid=="0627960";
(4 real changes made)

. replace newleaid="0600062" if leaid=="0627990";
(4 real changes made)

. replace newleaid="0643370" if leaid=="0628020";
(0 real changes made)

. replace newleaid="0600045" if leaid=="0628890";
(3 real changes made)

. replace newleaid="0600045" if leaid=="0628920";
(3 real changes made)

. replace newleaid="0600033" if leaid=="0628980";
(0 real changes made)

. replace newleaid="0600031" if leaid=="0629310";
(0 real changes made)

. replace newleaid="0606390" if leaid=="0629730";
(0 real changes made)

. replace newleaid="0600048" if leaid=="0629970";
(3 real changes made)

. replace newleaid="0600048" if leaid=="0630000";
(3 real changes made)

. replace newleaid="0600069" if leaid=="0630060";
(6 real changes made)

. replace newleaid="0600048" if leaid=="0630300";
(0 real changes made)

. replace newleaid="0600020" if leaid=="0631080";
(0 real changes made)

. replace newleaid="0600064" if leaid=="0631410";
(4 real changes made)

. replace newleaid="0600064" if leaid=="0631440";
(4 real changes made)

. replace newleaid="0600032" if leaid=="0632100";
(0 real changes made)

. replace newleaid="0621450" if leaid=="0632490";
(0 real changes made)

. replace newleaid="0600061" if leaid=="0633000";
(4 real changes made)

. replace newleaid="0600040" if leaid=="0633030";
(1 real change made)

. replace newleaid="0600040" if leaid=="0633060";
(1 real change made)

. replace newleaid="0600013" if leaid=="0633300";
(0 real changes made)

. replace newleaid="0634425" if leaid=="0634420";
(0 real changes made)

. replace newleaid="0691134" if leaid=="0634530";
(0 real changes made)

. replace newleaid="0600012" if leaid=="0634610";
(0 real changes made)

. replace newleaid="0691136" if leaid=="0634660";
(0 real changes made)

. replace newleaid="0605580" if leaid=="0635640";
(0 real changes made)

. replace newleaid="0614040" if leaid=="0636060";
(6 real changes made)

. replace newleaid="0614950" if leaid=="0636540";
(0 real changes made)

. replace newleaid="0636805" if leaid=="0636720";
(0 real changes made)

. replace newleaid="0636805" if leaid=="0636770";
(0 real changes made)

. replace newleaid="0600001" if leaid=="0637080";
(0 real changes made)

. replace newleaid="0600032" if leaid=="0637410";
(0 real changes made)

. replace newleaid="0600116" if leaid=="0637740";
(0 real changes made)

. replace newleaid="0600021" if leaid=="0638490";
(0 real changes made)

. replace newleaid="0600028" if leaid=="0638940";
(0 real changes made)

. replace newleaid="0600047" if leaid=="0639480";
(3 real changes made)

. replace newleaid="0600047" if leaid=="0639510";
(3 real changes made)

. replace newleaid="0691134" if leaid=="0639540";
(0 real changes made)

. replace newleaid="0691134" if leaid=="0639570";
(0 real changes made)

. replace newleaid="0600158" if leaid=="0640050";
(10 real changes made)

. replace newleaid="0600158" if leaid=="0640080";
(10 real changes made)

. replace newleaid="0600016" if leaid=="0640440";
(0 real changes made)

. replace newleaid="0691135" if leaid=="0640620";
(0 real changes made)

. replace newleaid="0600069" if leaid=="0640770";
(6 real changes made)

. replace newleaid="0600042" if leaid=="0641370";
(1 real change made)

. replace newleaid="0600012" if leaid=="0641490";
(0 real changes made)

. replace newleaid="0604080" if leaid=="0641670";
(0 real changes made)

. replace newleaid="0600063" if leaid=="0641700";
(4 real changes made)

. replace newleaid="0626280" if leaid=="0642390";
(7 real changes made)

. replace newleaid="0600034" if leaid=="0642870";
(0 real changes made)

. replace newleaid="0630660" if leaid=="0643350";
(0 real changes made)

. replace newleaid="0622110" if leaid=="0691053";
(0 real changes made)

. replace newleaid="0600085" if leaid=="0691054";
(0 real changes made)

. replace newleaid="0600088" if leaid=="0691056";
(0 real changes made)

. replace newleaid="0600150" if leaid=="0691057";
(0 real changes made)

. replace newleaid="0600090" if leaid=="0691060";
(0 real changes made)

. replace newleaid="0600092" if leaid=="0691061";
(0 real changes made)

. replace newleaid="0600093" if leaid=="0691064";
(0 real changes made)

. replace newleaid="0600096" if leaid=="0691065";
(0 real changes made)

. replace newleaid="0600097" if leaid=="0691066";
(0 real changes made)

. replace newleaid="0600098" if leaid=="0691067";
(0 real changes made)

. replace newleaid="0600099" if leaid=="0691068";
(0 real changes made)

. replace newleaid="0600100" if leaid=="0691069";
(0 real changes made)

. replace newleaid="0600101" if leaid=="0691070";
(0 real changes made)

. replace newleaid="0600102" if leaid=="0691071";
(0 real changes made)

. replace newleaid="0600073" if leaid=="0691072";
(0 real changes made)

. replace newleaid="0600074" if leaid=="0691073";
(0 real changes made)

. replace newleaid="0600075" if leaid=="0691074";
(0 real changes made)

. replace newleaid="0600077" if leaid=="0691075";
(0 real changes made)

. replace newleaid="0600078" if leaid=="0691076";
(0 real changes made)

. replace newleaid="0600079" if leaid=="0691077";
(0 real changes made)

. replace newleaid="0600103" if leaid=="0691079";
(0 real changes made)

. replace newleaid="0600105" if leaid=="0691081";
(0 real changes made)

. replace newleaid="0600106" if leaid=="0691082";
(0 real changes made)

. replace newleaid="0600108" if leaid=="0691084";
(0 real changes made)

. replace newleaid="0622710" if leaid=="0691085";
(0 real changes made)

. replace newleaid="0600110" if leaid=="0691086";
(0 real changes made)

. replace newleaid="0600111" if leaid=="0691087";
(0 real changes made)

. replace newleaid="0600112" if leaid=="0691088";
(0 real changes made)

. replace newleaid="0600117" if leaid=="0691089";
(0 real changes made)

. replace newleaid="0600118" if leaid=="0691091";
(0 real changes made)

. replace newleaid="0600081" if leaid=="0691094";
(0 real changes made)

. replace newleaid="0600120" if leaid=="0691095";
(0 real changes made)

. replace newleaid="0600080" if leaid=="0691096";
(0 real changes made)

. replace newleaid="0600121" if leaid=="0691097";
(0 real changes made)

. replace newleaid="0600122" if leaid=="0691098";
(0 real changes made)

. replace newleaid="0600123" if leaid=="0691099";
(0 real changes made)

. replace newleaid="0600124" if leaid=="0691100";
(0 real changes made)

. replace newleaid="0600082" if leaid=="0691101";
(0 real changes made)

. replace newleaid="0600083" if leaid=="0691103";
(0 real changes made)

. replace newleaid="0600094" if leaid=="0691104";
(0 real changes made)

. replace newleaid="0600095" if leaid=="0691105";
(0 real changes made)

. replace newleaid="0600130" if leaid=="0691107";
(0 real changes made)

. replace newleaid="0600131" if leaid=="0691108";
(0 real changes made)

. replace newleaid="0600132" if leaid=="0691109";
(0 real changes made)

. replace newleaid="0600138" if leaid=="0691110";
(0 real changes made)

. replace newleaid="0600139" if leaid=="0691113";
(0 real changes made)

. replace newleaid="0600140" if leaid=="0691114";
(0 real changes made)

. replace newleaid="0600137" if leaid=="0691116";
(0 real changes made)

. replace newleaid="0600143" if leaid=="0691117";
(0 real changes made)

. replace newleaid="0600125" if leaid=="0691118";
(0 real changes made)

. replace newleaid="0600157" if leaid=="0691121";
(0 real changes made)

. replace newleaid="0600128" if leaid=="0691123";
(0 real changes made)

. replace newleaid="0600129" if leaid=="0691124";
(0 real changes made)

. replace newleaid="0600145" if leaid=="0691126";
(0 real changes made)

. replace newleaid="0600146" if leaid=="0691127";
(0 real changes made)

. replace newleaid="0600147" if leaid=="0691128";
(0 real changes made)

. replace newleaid="0600148" if leaid=="0691129";
(0 real changes made)

. replace newleaid="0600149" if leaid=="0691130";
(0 real changes made)

. replace newleaid="0600141" if leaid=="0691131";
(0 real changes made)

. replace newleaid="0600142" if leaid=="0691132";
(0 real changes made)

. replace newleaid="0600133" if leaid=="0691133";
(0 real changes made)

. drop if newleaid=="";
(0 observations deleted)

. duplicates report newleaid year;

Duplicates in terms of newleaid year

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |        10647             0
        2 |          166            83
        3 |           15            10
--------------------------------------

. tempfile newleaids;

. save `newleaids';
file C:\DOCUME~1\JESSER~1\LOCALS~1\Temp\ST_00000089.tmp save
> d

. *Make a crosswalk;
.  keep leaid year newleaid;

.  sort leaid year;

.  save newleaids_xwalk.dta, replace;
file newleaids_xwalk.dta saved

. *Prepare data from the CCD agency files for analysis with 
> school bonds data;
.  *use if stfips==6 & year>=1996 using `ccddir'\agency\agpa
> nel.dta;
.  use if stfips==6 & year>=1996 using `ccddir'\agpanel.dta;

.  replace year=year-1;
(11973 real changes made)

.  keep leaid enroll enrollg nskls nteach year;

.  sort leaid year;

.  *Merge to new leaids;
.   merge leaid year using newleaids_xwalk, unique;

.  tab _merge;

     _merge |      Freq.     Percent        Cum.
------------+-----------------------------------
          1 |      1,145        9.56        9.56
          3 |     10,828       90.44      100.00
------------+-----------------------------------
      Total |     11,973      100.00

.  keep if _merge==3;
(1145 observations deleted)

.  drop _merge;

.  sort leaid year;

.  tempfile ccdagdat;

.  save `ccdagdat';
file C:\DOCUME~1\JESSER~1\LOCALS~1\Temp\ST_0000008a.tmp save
> d

. use `newleaids';

. sort leaid year;

. merge leaid year using `ccdagdat', unique;

. drop _merge;

. sort newleaid year;

. foreach v of varlist v33 totalrev tfedrev tstrev c11 tlocr
> ev t06 t09 t15 t40 t99  t02 d23 d11
>                      a07 a08 a09 a11 a13 a20 a15 u22 u97 t
> otalexp tcurinst tcurssvc v40 v45
>                      tcuroth v60 tnonelse tcapout f12 k09 
> k10 k11 g15 tcurelsc l12 m12 q11
>                      i86 z32 z33 v13 v15 v17 z34 _19h _21f
>  _31f _41f _61v _66v c01 c12 c13
>                      c35 w01 w31 w61 enroll enrollg nskls 
> nteach {;
  2.    replace `v'=. if `v'<0;
  3.   };
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(6 real changes made, 6 to missing)
(6 real changes made, 6 to missing)
(6 real changes made, 6 to missing)
(6 real changes made, 6 to missing)
(6 real changes made, 6 to missing)
(6852 real changes made, 6852 to missing)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(0 real changes made)
(6 real changes made, 6 to missing)
(6 real changes made, 6 to missing)
(6 real changes made, 6 to missing)
(7 real changes made, 7 to missing)
(7 real changes made, 7 to missing)
(7 real changes made, 7 to missing)
(82 real changes made, 82 to missing)

. collapse (sum) v33 totalrev tfedrev tstrev c11 tlocrev t06
>  t09 t15 t40 t99  t02 d23 d11
> a07 a08 a09 a11 a13 a20 a15 u22 u97 totalexp tcurinst tcur
> ssvc v40 v45 tcuroth v60 tnonelse tcapout
> f12 k09 k10 k11 g15 tcurelsc l12 m12 q11 i86 z32 z33 v13 v
> 15 v17 z34 _19h _21f _31f _41f _61v _66v
> c01 c12 c13 c35 w01 w31 w61
> enroll enrollg nskls nteach
> (median) csa cbsa stfips cofips, by(newleaid year);

. *note: i am losing many variables, only keep newleaid year
>  + those which make sense to be added;
. sort newleaid year;

. label var newleaid "Consistent LEAID over time";

. tempfile financepanel;

. save `financepanel';
file C:\DOCUME~1\JESSER~1\LOCALS~1\Temp\ST_0000008c.tmp save
> d

. save financepanel, replace;
file financepanel.dta saved

. log close;
       log:  C:\Documents and Settings\Jesse Rothstein\My Do
> cuments\projects\caelections\archive\makefinancepanel.log
  log type:  text
 closed on:   6 Mar 2010, 13:34:30
------------------------------------------------------------
