------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\parentor\OneDrive - University of Cincinnati\workingpapers\RD\codes\Rohstein\tab7-dynamic.log
  log type:  text
 opened on:  16 Jul 2024, 13:27:25

. 
. # delimit;
delimiter now ;
. version 9.0;

. set more off;

. clear;

. /************************************************************
> * tab5.do
> * Jesse Rothstein
> * June 26, 2008
> *
> * Run finance regressions with long panel.
> * Uses data from fullpanel.dta, created by "makefullpanel.do".
> *
> **************************************************************/
> 
> 
> set mem 100m;

. set matsize 700;

. local projectbase "C:\Users\parentor\OneDrive - University of Cincinnati\workingpapers\RD\codes\Rohstein\";

. cd "C:\Users\parentor\OneDrive - University of Cincinnati\workingpapers\RD\codes\Rohstein\";
C:\Users\parentor\OneDrive - University of Cincinnati\workingpapers\RD\codes\Rohstein

. use "test_fullpanel";
file test_fullpanel.dta not found
r(601);

end of do-file

r(601);

. exit, clear
